"""
 学习目标：1.掌握位置参数
         2.掌握关键字参数
         3.掌握不定长参数
         4.掌握缺省参数
 函数参数种类：
    1.位置参数：调用函数时根据函数定义的参数位置来传递参数
        注意：传递的参数和定义的参数的顺序及个数必须一致
    2.关键字参数：函数调用时通过"键=值"的形式传递参数，可以不按照固定顺序
        作用：可以让函数更加清晰、容易使用，同时也清除了参数的顺序需求
        注意：函数调用时，如果有位置参数时，位置参数必须在关键字参数的前面，但关键字参数之间不存在先后顺序（关键字参数和位置参数混用的情况）
    3.缺省参数：也叫默认参数，用于定义函数，为参数提供默认值，调用函数时可不传该默认参数的值
        作用：当调用函数时没有传递参数，就会使用默认是用缺省参数对应的值
        注意：所有位置参数必须出现在默认参数前，也包括函数定义和调用
    3.不定长参数：也叫可变参数，用于不确定调用的时候会传递多少个参数（不传参数也可以）的场景
        作用：当调用参数时不确定参数个数时，可以使用不定长参数
        不定长参数类型：1.位置传递：以一个*标记一个形式参数
                     2.关键字传递：以俩个*标记一个形式参数
"""
# 演示多种传参的形式
def user_info(name,age,gender):
    print(f"姓名是：{name},年龄是：{age},性别是：{gender}")

# 位置参数形式
user_info("小明",20,"男")
user_info(20,"小明",'男')

#关键字参数
user_info(name='小王',age=11,gender="女") # 顺序
user_info(age=11,name='小王',gender="女") # 乱序，但不影响接收的内容
user_info('庄严',gender='男',age=23) # 与位置参数混用，位置参数必须在前，关键字参数可以乱序

# 缺省参数（默认值）
def user_info(name,age,gender="男"): # 注意默认值得在最后
    print(f"姓名是：{name},年龄是：{age},性别是：{gender}")

user_info("小天",13) # 如果不传就是默认男
user_info("小天",13,"女") # 也可以传其他的

# 不定长参数之位置传递
# 注意：传进的所有参数都会被args变量收集，它会根据传进参数的位置合并为一个元组，args是元组类型，这就是位置传递
# args是默认规范，写其他也行，如*i，*g
def user_info(*args):
    print(f"args参数的类型是：{type(args)},内容是：{args}")
user_info('庄严',1,2,3)

# 不定长参数之关键字传递
# 参数是“键=值”形式的情况下，所有的“键=值”都会被kwargs接收，同时会根据“键=值”组成字典
# kwargs也是默认规范，写别的也行，**不能省
def user_info(**kwargs):
    print(f"kwargs参数的类型是：{type(kwargs)},内容是：{kwargs}")
user_info(name="庄严",age=11,gender='男孩',addr='北京')