"""
 思考：列表是可以修改的，如果想要传递的信息，是不被篡改的，列表就不合适了
    引出元组，元组和列表一样，都是可以封装多个不同类型的元素在内
    但最大的不同点在于：元组一旦定义完成，就不可以修改
    所以，当我们需要在程序内封装数据，又不希望封装的数据被篡改，那么元组就非常合适了
 元组的定义：使用小括号，且使用逗号隔开各个数据，数据可以是不同的类型
    定义元组字面量：(元素,元素,...,元素)
    定义元组变量：变量名称 = (元素,元素,...,元素)
    定义空元组：
        1.变量名称 = ()
        2.变量名称 = tuple()
    注意：元组只有一个数据时，这个数据后面要添加逗号
    如： t2 = ("hellp",)
 元组的相关操作：
    1.index()查找 如果是嵌套元组要整个元组去查下标，如.index((1,2))
    2.count()统计某元素出现个数
    3.len(元组)统计元组元素个数
"""
# 定义元组
t1 = (1,"hello",True)
t2 = ()
t3 = tuple()
# 定义单个元素的元组
t4 = ("hello")
print(f"没加逗号是字符串：\t{type(t4)}")
t5 = ("hello",)
print(f"加逗号是元组：\t{type(t5)}")
# 元组的嵌套
t6 = ((1,2,3),(4,5,6))
print(f"t5的类型是：\t\t{type(t6)}，内容是：{t6}")
# 下标索引取出内容
num = t6[1][2]
print(f"从t6嵌套元组取出的数据是：{num}")
# index查找
t7 = ("庄严","帅","哥")
index = t7.index("庄严")
print(f"元组t7中庄严的下标是：{index}")
# count统计
t8 = (1,1,2,3,4,5)
num = t8.count(1)
print(f"t8中1出现的次数为：{num}")
# len(元组)
num2 = len(t8)
print(f"t8中元素的个数为：{num2}")
# while循环遍历
index = 0
while index < len(t8):
    print(f"元组的元素有：{t8[index]}")
    index += 1
print()
# for循环
for item in t8:
    print(f"元组的元素有：{item}")
# 元组的修改：只有元组内嵌套列表才能修改（特例）
t9 = (1,2,['庄严'])
print(f"t9的内容是{t9}")
t9[2][0] = "很帅"
print(f"修改后的元组(只有内部嵌套的列表可以修改)：{t9}")