"""
 序列：指内容连续、有序、可使用下标索引的一类数据容器
      列表、元组、字符串均可以视为序列
 序列的常用操作
    切片：从一个序列中，取出一个子序列
        1.语法：序列[起始下标:结束下标:步长]
        2.总结注意：
            1.起始可以省略，省略表示从头开始
            2.结束可以省略，省略表示到尾结束
            3.步长可以省略，省略表示步长为1，可以为负数，表示倒序执行
"""
# 对列表进行切片，从1开始，到4结束，步长为1
my_list = [0,1,2,3,4,5,6]
result1 = my_list[1:4] # 步长默认为1，可以不写
print(f"结果1:{result1}")

# 对元组进行切片，从头到尾步长为1
my_tuple = (0,1,2,3,4,5,6)
result2 = my_tuple[:] # 起始和结束不写表示从头到尾，步长为1可以省略
print(f"结果2:{result2}")

# 对字符串进行切片，从头开始，到尾结束，步长为2
my_str = "0123456"
result3 = my_str[::2]
print(f"结果3:{result3}")

# 对字符串进行切片，从头开始，到尾结束，步长为-1
my_str = "0123456"
result4 = my_str[::-1] # 从尾开始取，等于把序列反转了
print(f"结果4:{result4}")

# 对列表进行切片，从3开始，到1结束，步长为-1
my_list = [0,1,2,3,4,5,6]
result5 = my_list[3:1:-1] # 步长默认为1，可以不写
print(f"结果5:{result5}")

# 对元组进行切片，从头开始，到尾结束，步长为-2
my_tuple = (0,1,2,3,4,5,6)
result6 = my_tuple[::-2]
print(f"结果6:{result6}")
