"""
 为什么使用字典？
    生活中的字典：通过“字”，就能找到对应的含义，我们可以认为生活中的字典就是记录一堆 （【字】：【含义】 ）
    python中的字典：就是通过key去找到对应的value （【key】：【value】）
 为什么需要字典？
    如：老师有一份名单，记录了学生姓名和考试成绩，现在需要将其通过python录入至程序红，并可以通过学生姓名检索学生成绩。
       通过字典最合适，通过key（学生姓名）找到对应的value（考试成绩）
    答：所以为什么使用字典，因为可以使用字典，实现用key取出value的操作
 字典的key是不可以重复的
 一.字典数据的获取：字典同集合一样，不可以使用下标索引，但是字典可以通过key值来取的对应的value
"""
# 字典的定义：同样使用{}，不过存储的元素是一个个的：键值对 {key:value,key:value,...,key:value}
my_dict1 = {"王力宏":99,"周杰伦":88,"林俊杰":77}

#定义空字典
my_dict2 = {}   #空的大括号被字典占用了，所以这就是集合为什么只能用set()来定义空集合
my_dict3 = dict()
print(f"字典1的内容是:{my_dict1},类型是:{type(my_dict1)}")
print(f"字典2的内容是:{my_dict2},类型是:{type(my_dict2)}")
print(f"字典3的内容是:{my_dict3},类型是:{type(my_dict3)}")

# 定义重复key的字典：虽然不会报错，但覆盖（重复添加等于覆盖掉原本的数据）
my_dict1 = {"王力宏":99,"王力宏":88,"林俊杰":77}
print(f"重复key的字典的内容是：{my_dict1}")

# 从字典中基于key获取value
my_dict1 = {"王力宏":99,"周杰伦":88,"林俊杰":77}
score = my_dict1["王力宏"]
print(f"王力宏的考试分数是:{score}")

# 字典的嵌套
stu_score_dict = {
    "王力宏":{
        "语文":77,
        "数学":66,
        "英语":33
    },"周杰伦":{
        "语文":88,
        "数学":86,
        "英语":55
    },"林俊杰":{
        "语文":99,
        "数学":96,
        "英语":66
    }
}
print(f"学生的考试信息：{stu_score_dict}")
# 从嵌套字典中获取数据，看一下周杰伦的语文成绩
score = stu_score_dict["周杰伦"]["语文"]
print(f"周杰伦的语文成绩是：{score}")
score = stu_score_dict["林俊杰"]["英语"]
print(f"林俊杰的英语成绩是：{score}")