"""
 异常是具有传递性的
 当自定义函数1中有异常，并且没有捕捉这个异常，自定义函数2调用自定义函数1也没有捕捉这个异常，最后main函数去捕捉异常的时候能捕捉到自定义函数1的异常
 这就是异常的传递性，能根据调用一层一层传递
 注意：当所有函数都没有捕捉异常时，程序就会报错
 不需要在最底层出现异常的那句代码去捕获，在高层也可以捕获这个异常
"""
# 演示异常的传递性

# 定义一个出现异常的函数
def func1():
 print("func1 开始执行")
 num = 1/0          # 除0异常
 print("func1 结束执行")

# 定义一个无异常的方法，调用上面的方法
def func2():
 print("func2 开始执行")
 func1()
 print("func2 结束执行")

def main():
    try:          # 传递到这里被捕获了
        func2()
    except Exception as e:
        print(f"出现异常了，异常的信息是:{e}")
main()