"""
 思考：基于python模块，我们可以在编写代码的时候导入许多外部代码来丰富功能
      但是，如果python的模块太多了，就可能造成一定的混乱，那么该如何管理呢
 答：通过python包的功能来管理

 什么是python包？
 从物理上看，模块就是文件，而包就是文件夹，该文件夹（内包含了一个__init__.py文件）可用于包含多个模块文件
 从逻辑上看，包的本质依然是模块

 包的作用：
 当我们的模块文件越来越多的时候，包可以帮助我们管理这些模块，包的作用就是包含多个模块，当包的本质仍然是模块

 快速入门：
 1.新建包
 2.新建包内模块
 注意：新建包后，包内部会自动创建 __init__.py 文件，这个文件控制着包的导入行为

 导入包：
 import 包名.模块名
 包名.模块名.需要用的
"""

# 创建一个包：在同目录下my_package
# 导入自定义的包中模块，并使用
import my_package.my_module1
my_package.my_module1.info_print1()

# 通过 __all__ 变量，控制import *
# 注意，包要写到包下的 __init__.py 里
my_package.my_module2.info_print2() # 报错，被 __init__.py 中的all控制了，用不了
