"""
 学习目标：
 1.掌握类的定义和使用语法
 2.掌握成员的使用方法
 3.掌握self关键字的作用

 一.类的定义和使用：
 class 类名称:
    类的属性：定义在类中的变量（成员变量）
    类的行为：定义在类的函数（成员方法）  区别：函数是写在类外面的，写在类里面的函数叫做方法
 创建类对象的语法：
 对象 = 类名称()

 在类中定义成员方法和定义函数基本一致，但有细微区别：
 def 方法名(self,形参1,,,,形参n)
    方法体
 区别：self关键字
 1.它是用来表示类对象自身的意思
 2.当我们使用类对象调用方法的时候，self会自动被python传入
 3.在方法内部，想要访问类的成员变量，必须使用self 注意注意注意

 @staticmethod = 把函数塞进类里"占个位置、归个类"，但不需要实例就能直接调用。
 每个成员方法前加@staticmethod，就不需要self，也可以直接 类.成员方法 ，不需要创造实例

"""
# 定义一个带有成员方法的类
class Student:
    name = None                                    # 学生姓名

    def say_hello(self):                           # self必须出现在传参列表中
        print(f"大家好啊，我是{self.name}")           # 注意：成员方法中使用成员变量必须加self.

    def say_hi(self,msg):
        print(f"大家好啊，我是{self.name}，{msg}")     # 外部传入的参数调用不需要加self.

stu = Student()
stu.name = "庄严"
stu.say_hello()                                    # 调用的时候括号内不需要写self，当不存在

stu_1 = Student()
stu_1.name = "庄粤"
stu_1.say_hi("小伙子我看好你哦")                      # 调用的时候括号内不需要写self，当不存在

