"""
 学习目标：
 1.掌握使用类描述现实世界事物的思想
 2.掌握类和对象的关系
 3.理解什么是面向对象
 一.现实世界的事物和类：
 现实的事和物都有属性和行为
 如：
 物：手机  --> 属性：长宽高，重量    行为：打电话，上网，拍照
 事：做核酸 --> 属性：何时，何地     行为：登记，检测，查验结果
 所以使用程序中的类，可以完美地描述现实世界的事物

 现实世界的事物由属性和行为组成，类也可以包含属性和行为，所以使用类描述现实世界事物是非常合适的

 二.类和对象
 基于类创建对象的语法：对象名 = 类名称()
 为什么非要创建对象才能使用呢？
 答：类只是一种程序内的设计图纸，需要基于图纸生产出实体（对象），才能正常工作

 这就是面向对象编程：设计类，基于类，去创建对象，由对象做具体的工作
 """
# 演示类和对象的关系，即面向对象的编程套路（思想）

# 设计一个闹钟类
class Clock:
    id = None                # 序列化
    price = None             # 价格

    def ring(self):
        import winsound
        winsound.Beep(2000,3000)

clock_1 = Clock()
clock_1.id = "003032"
clock_1.price = 19.99
print(f"闹钟id：{clock_1.id}，价格：{clock_1.price}")
clock_1.ring()
clock_2 = Clock()

