"""
 学习目标：
 1.理解封装的概念
 2.掌握私有成员的使用

 面向对象的三大特征
 1.封装
 2.继承
 3.多态

 封装：将现实世界的属性和行为，封装到类中，描述为成员变量和成员方法，从而完成程序对现实世界事物的描述

 对用户隐藏的属性和行为：现实世界中的事物，有属性和行为，但不代表这些属性和行为都是开放给用户使用的 --> 引出私有成员
 如：手机的运行电压，驱动信息，程序调度，内存管理

 私有成员：既然现实事物有不公开的属性和行为，那么作为现实事物在程序中映射的类，也应该支持
 类中提供了私有成员的形式来支持，分为：
 1.私有成员变量
 2.私有成员方法
 定义私有成员的方式非常简单，只需要：
 1.私有成员变量：变量名以2个下划线开头__
 2.私有成员方法：变量名以2个下划线开头__

 使用私有成员：
 私有成员无法被类对象使用，但是可以被其他的成员使用 （类内部使用）

 私有成员存在的意义：在类中提供仅供内部使用的属性和方法，而不对外开放（类对象没办法使用）
"""

class Phone:
    __current_voltage = 1          # 当前手机运行电压

    def __keep_single_core(self):
        print("让cpu以单核模式运行")
    def call_by_5g(self):           # 私有的东西只能够内部使用
        if self.__current_voltage >= 1:
            print("5g通话已开启")
        else:
            print("电量不足，无法使用5g通话，并已设置为单核运行")
phone = Phone()
# phone.__keep_single_core()            # 私有成员方法，类对象不能使用
# print(phone.__current_voltage)        # 私有成员变量，类对象不能使用
phone.call_by_5g()                      # 私有的能在类内部使用